<?php
/**
 * Created by PhpStorm.
 * User: sunzhongwei
 * Date: 2018/12/20
 * Time: 14:52
 */
return [
    
    /*
    |--------------------------------------------------------------------------
    |  k8s资源创建的状态码
    |--------------------------------------------------------------------------
    |  1** 处理中
    |  2** 成功
    |  4** deploy内部部署错误，主要是程序执行一些异常
    |  5** kubernetes内部部署失败
    |  暂时只需要100,200,400,500这三个code去概括，后续会具体补充
    |
    */
    'processing'       => 100,
    'success'          => 200,
    'programException' => 400,
    'k8sException'     => 500,
];